# Day 49/60  Sickit-learn day 3

# One Hot Encoder

In [9]:
'''
preprocessing steps when working with categorical data is one-hot encoding.
This technique transforms categorical variables into a format that can be provided to machine learning algorithms to improve predictions and insights.
One-hot encoding is a method to convert these categorical labels into a binary matrix, where each column represents a unique category, and the presence 
of a category is marked by a 1, while all other columns are marked by 0.
'''
import pandas as pd

In [10]:
d = {'sales': [100000,222000,1000000,522000,111111,222222,1111111,20000,75000,90000,1000000,10000], 'city': ['Tampa','Tampa','Orlando','Jacksonville','Miami','Jacksonville','Miami','Miami','Orlando','Orlando','Orlando','Orlando'], 'size': ['Small', 'Medium','Large','Large','Small','Medium','Large','Small','Medium','Medium','Medium','Small',]}

In [11]:
df = pd.DataFrame(data = d)
df.head()

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [12]:
df['city'].unique()

array(['Tampa', 'Orlando', 'Jacksonville', 'Miami'], dtype=object)

In [13]:
from sklearn.preprocessing import OneHotEncoder

In [14]:
#creating and configuring an instance of the OneHotEncoder class from the sklearn.preprocessing module in scikit-learn
ohe = OneHotEncoder(handle_unknown='ignore', sparse_output=False).set_output(transform="pandas")

In [15]:
# applying to DataFrame
ohetransform = ohe.fit_transform(df[['size']])

In [16]:
print(ohetransform)

    size_Large  size_Medium  size_Small
0          0.0          0.0         1.0
1          0.0          1.0         0.0
2          1.0          0.0         0.0
3          1.0          0.0         0.0
4          0.0          0.0         1.0
5          0.0          1.0         0.0
6          1.0          0.0         0.0
7          0.0          0.0         1.0
8          0.0          1.0         0.0
9          0.0          1.0         0.0
10         0.0          1.0         0.0
11         0.0          0.0         1.0

In [17]:
df = pd.concat([df,ohetransform],axis=1).drop(columns=["size"])
df

      sales          city  size_Large  size_Medium  size_Small
0    100000         Tampa         0.0          0.0         1.0
1    222000         Tampa         0.0          1.0         0.0
2   1000000       Orlando         1.0          0.0         0.0
3    522000  Jacksonville         1.0          0.0         0.0
4    111111         Miami         0.0          0.0         1.0
5    222222  Jacksonville         0.0          1.0         0.0
6   1111111         Miami         1.0          0.0         0.0
7     20000         Miami         0.0          0.0         1.0
8     75000       Orlando         0.0          1.0         0.0
9     90000       Orlando         0.0          1.0         0.0
10  1000000       Orlando         0.0          1.0         0.0
11    10000       Orlando         0.0          0.0         1.0